Masmiseim36/nxpSDK/boards/frdmk32l2b/ntag_i2c_plus_examples/ntag_i2c_explorer_demo/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLCD
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLCD(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    const port_pin_config_t portb18_pin41_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Slow slew rate is configured */
                                                    kPORT_SlowSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as LCD_P14 */
                                                    kPORT_PinDisabledOrAnalog};
    /* PORTB18 (pin 41) is configured as LCD_P14 */
    PORT_SetPinConfig(PORTB, 18U, &portb18_pin41_config);

    const port_pin_config_t portb19_pin42_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Slow slew rate is configured */
                                                    kPORT_SlowSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as LCD_P15 */
                                                    kPORT_PinDisabledOrAnalog};
    /* PORTB19 (pin 42) is configured as LCD_P15 */
    PORT_SetPinConfig(PORTB, 19U, &portb19_pin42_config);

    const port_pin_config_t portc0_pin43_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P20 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTC0 (pin 43) is configured as LCD_P20 */
    PORT_SetPinConfig(PORTC, 0U, &portc0_pin43_config);

    const port_pin_config_t portc4_pin53_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P24 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTC4 (pin 53) is configured as LCD_P24 */
    PORT_SetPinConfig(PORTC, 4U, &portc4_pin53_config);

    const port_pin_config_t portc6_pin55_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P26 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTC6 (pin 55) is configured as LCD_P26 */
    PORT_SetPinConfig(PORTC, 6U, &portc6_pin55_config);

    const port_pin_config_t portc7_pin56_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P27 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTC7 (pin 56) is configured as LCD_P27 */
    PORT_SetPinConfig(PORTC, 7U, &portc7_pin56_config);

