Masmiseim36/nxpSDK/boards/frdmk32l2b/ntag_i2c_plus_examples/ntag_i2c_explorer_demo/pin_mux.c
    const port_pin_config_t portd0_pin57_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P40 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTD0 (pin 57) is configured as LCD_P40 */
    PORT_SetPinConfig(PORTD, 0U, &portd0_pin57_config);

    const port_pin_config_t portd2_pin59_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P42 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTD2 (pin 59) is configured as LCD_P42 */
    PORT_SetPinConfig(PORTD, 2U, &portd2_pin59_config);

    const port_pin_config_t portd3_pin60_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P43 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTD3 (pin 60) is configured as LCD_P43 */
    PORT_SetPinConfig(PORTD, 3U, &portd3_pin60_config);

    const port_pin_config_t portd4_pin61_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P44 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTD4 (pin 61) is configured as LCD_P44 */
    PORT_SetPinConfig(PORTD, 4U, &portd4_pin61_config);

    const port_pin_config_t porte20_pin9_config = {/* Internal pull-up resistor is enabled */
                                                   kPORT_PullUp,
                                                   /* Slow slew rate is configured */
                                                   kPORT_SlowSlewRate,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as LCD_P59 */
                                                   kPORT_PinDisabledOrAnalog};
    /* PORTE20 (pin 9) is configured as LCD_P59 */
    PORT_SetPinConfig(PORTE, 20U, &porte20_pin9_config);

    const port_pin_config_t porte21_pin10_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Slow slew rate is configured */
                                                    kPORT_SlowSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as LCD_P60 */
                                                    kPORT_PinDisabledOrAnalog};
    /* PORTE21 (pin 10) is configured as LCD_P60 */
    PORT_SetPinConfig(PORTE, 21U, &porte21_pin10_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtons:
- options: {coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '26', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: PTA4/I2C1_SDA/TPM0_CH1/NMI_b, direction: INPUT, slew_rate: fast, pull_select: up, pull_enable: enable,
    passive_filter: disable}
  - {pin_num: '46', peripheral: GPIOC, signal: 'GPIO, 3', pin_signal: LCD_P23/PTC3/LLWU_P7/SPI1_SCK/LPUART1_RX/TPM0_CH2/CLKOUT, direction: INPUT, slew_rate: fast,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

